archives/2024/Results/Verifications/S2427/read_only/tidb-server-rv64gcv_zfh_xtheadba_xtheadcondmov_xtheadmac.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 188.20 qps: 3024.63 (r/w/o: 2647.12/0.00/377.50) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 163.51 qps: 2616.97 (r/w/o: 2289.95/0.00/327.02) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 167.80 qps: 2681.84 (r/w/o: 2346.14/0.00/335.71) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 187.69 qps: 3003.47 (r/w/o: 2628.09/0.00/375.38) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 197.60 qps: 3161.75 (r/w/o: 2766.54/0.00/395.21) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 200.79 qps: 3215.38 (r/w/o: 2813.90/0.00/401.49) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 197.01 qps: 3152.38 (r/w/o: 2758.27/0.00/394.11) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 202.50 qps: 3237.24 (r/w/o: 2832.33/0.00/404.90) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 198.10 qps: 3170.50 (r/w/o: 2774.20/0.00/396.30) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 203.40 qps: 3254.71 (r/w/o: 2847.91/0.00/406.80) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 191.30 qps: 3059.00 (r/w/o: 2676.50/0.00/382.50) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 199.60 qps: 3194.50 (r/w/o: 2795.20/0.00/399.30) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 189.30 qps: 3029.80 (r/w/o: 2651.20/0.00/378.60) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 191.40 qps: 3063.11 (r/w/o: 2680.31/0.00/382.80) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 188.70 qps: 3019.00 (r/w/o: 2641.60/0.00/377.40) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 195.60 qps: 3129.48 (r/w/o: 2738.28/0.00/391.20) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 201.00 qps: 3215.51 (r/w/o: 2813.51/0.00/402.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 198.30 qps: 3171.20 (r/w/o: 2774.60/0.00/396.60) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 199.60 qps: 3195.67 (r/w/o: 2796.47/0.00/399.20) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 201.80 qps: 3228.02 (r/w/o: 2824.51/0.00/403.50) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 200.20 qps: 3204.48 (r/w/o: 2803.99/0.00/400.50) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 197.50 qps: 3158.63 (r/w/o: 2763.63/0.00/395.00) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 195.80 qps: 3133.99 (r/w/o: 2742.39/0.00/391.60) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 196.70 qps: 3148.60 (r/w/o: 2755.20/0.00/393.40) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 190.10 qps: 3038.40 (r/w/o: 2658.20/0.00/380.20) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 189.10 qps: 3027.70 (r/w/o: 2649.60/0.00/378.10) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 182.60 qps: 2920.00 (r/w/o: 2554.70/0.00/365.30) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 196.70 qps: 3146.20 (r/w/o: 2752.90/0.00/393.30) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 193.50 qps: 3099.00 (r/w/o: 2711.90/0.00/387.10) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 200.50 qps: 3207.80 (r/w/o: 2806.80/0.00/401.00) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 199.00 qps: 3182.60 (r/w/o: 2784.60/0.00/398.00) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 199.30 qps: 3188.19 (r/w/o: 2789.59/0.00/398.60) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 198.58 qps: 3179.50 (r/w/o: 2782.35/0.00/397.15) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 199.53 qps: 3191.60 (r/w/o: 2792.55/0.00/399.05) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 189.90 qps: 3037.99 (r/w/o: 2658.19/0.00/379.80) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 184.10 qps: 2946.31 (r/w/o: 2578.11/0.00/368.20) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 184.90 qps: 2958.40 (r/w/o: 2588.60/0.00/369.80) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 194.90 qps: 3117.30 (r/w/o: 2727.50/0.00/389.80) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 180.90 qps: 2894.60 (r/w/o: 2532.90/0.00/361.70) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 183.80 qps: 2940.11 (r/w/o: 2572.40/0.00/367.70) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 198.40 qps: 3172.99 (r/w/o: 2776.19/0.00/396.80) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 193.20 qps: 3093.26 (r/w/o: 2706.87/0.00/386.40) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 198.20 qps: 3171.34 (r/w/o: 2774.93/0.00/396.40) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 198.00 qps: 3162.61 (r/w/o: 2766.61/0.00/396.00) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 197.80 qps: 3171.47 (r/w/o: 2775.88/0.00/395.60) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 192.70 qps: 3082.20 (r/w/o: 2696.80/0.00/385.40) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 188.70 qps: 3017.92 (r/w/o: 2640.62/0.00/377.30) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 191.30 qps: 3061.41 (r/w/o: 2678.71/0.00/382.70) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 184.20 qps: 2943.77 (r/w/o: 2575.47/0.00/368.30) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 189.80 qps: 3039.50 (r/w/o: 2659.80/0.00/379.70) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 180.90 qps: 2894.50 (r/w/o: 2532.80/0.00/361.70) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 197.30 qps: 3157.40 (r/w/o: 2762.70/0.00/394.70) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 188.26 qps: 3014.40 (r/w/o: 2637.88/0.00/376.51) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 198.57 qps: 3174.80 (r/w/o: 2777.67/0.00/397.14) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 196.17 qps: 3137.19 (r/w/o: 2744.84/0.00/392.35) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 199.80 qps: 3198.29 (r/w/o: 2798.89/0.00/399.40) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 205.50 qps: 3286.88 (r/w/o: 2875.68/0.00/411.20) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 189.50 qps: 3035.40 (r/w/o: 2656.40/0.00/379.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 182.00 qps: 2912.27 (r/w/o: 2548.26/0.00/364.01) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 193.39 qps: 3092.62 (r/w/o: 2705.83/0.00/386.79) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1622012
        write:                           0
        other:                           231716
        total:                           1853728
    transactions:                        115858 (193.08 per sec.)
    queries:                             1853728 (3089.23 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0574s
    total number of events:              115858

Latency (ms):
         min:                                   44.65
         avg:                                   62.14
         max:                                  451.03
         95th percentile:                       81.48
         sum:                              7199811.86

Threads fairness:
    events (avg/stddev):           9654.8333/5.86
    execution time (avg/stddev):   599.9843/0.01